Tekla Open API Reference for Tekla Structures 2025
GenericAttributesBase Methods
The GenericAttributesBase type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
GenericAttributesBase Class
Tekla.Structures.Drawing Namespace